# ProjectPosition Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectPosition Class
Members See Also
---
ProjectPosition is a class used to represent a geographical offset and rotation. It can be used to represent the position of a project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ProjectPosition : IDisposable
```

Visual Basic
---
```text
Public Class ProjectPosition _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ProjectPosition : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ProjectPosition
# See Also
ProjectPosition Members
Autodesk.Revit.DB Namespace